Revit 2027 API
CustomInitialColor Properties
The CustomInitialColor type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from InitialColor)
Temperature |  The custom color temperature value.
TemperatureValue |  The light color temperature value in Kelvins.
(Inherited from InitialColor)
Top
See Also
Reference
CustomInitialColor Class
Autodesk.Revit.DB.Lighting Namespace